evidence/OPS-2204/k6-before.txt
===============================================================================
OPS-2204 BEFORE — 50 VUs, 2 min, reproduce-OPS-2204.js
k6 window unix 1787035847 -> 1787035968
===============================================================================

NOTE ON THIS FILE: k6 emitted one warning line per failed request. At 1,200,251
failures that raw log was 207 MB, over GitHub's 100 MB limit, and 99.99% of it
was the same line repeated. The per-request lines are replaced by the aggregated
failure breakdown below, which carries strictly more information. The k6 summary
that follows is verbatim and untouched.

FAILURE BREAKDOWN (all 1,200,251 failures, aggregated from the raw log)
-------------------------------------------------------------------------------
  1,155,611   dial tcp 127.0.0.1:3000: connect: connection refused    96.28%
      1,479   EOF                                                      0.12%
     ~3,100   read tcp ...: read: connection reset by peer             0.26%
          5   http: server closed idle connection                      0.00%
  (remainder: the same three classes across other ephemeral ports)

READ THIS: 96.28% is CONNECTION REFUSED — there was no process listening. The
service was not slow, not shedding, not erroring: it was ABSENT. The ~4,600
EOF / reset-by-peer failures are the requests that were mid-flight at the moment
the kernel SIGKILLed the process; they are the only ones that ever reached a
running server. data_received across the whole run was 0 B.


         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/reproduce-OPS-2204.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 2m30s max duration (incl. graceful stop):
              * nightly_export: 50 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
nightly_export   [   1% ] 50 VUs  0m01.0s/2m0s

running (0m02.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
nightly_export   [   2% ] 50 VUs  0m02.0s/2m0s

running (0m03.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
nightly_export   [   2% ] 50 VUs  0m03.0s/2m0s

running (0m04.0s), 50/50 VUs, 2357 complete and 0 interrupted iterations
nightly_export   [   3% ] 50 VUs  0m04.0s/2m0s

running (0m05.0s), 50/50 VUs, 3943 complete and 0 interrupted iterations
nightly_export   [   4% ] 50 VUs  0m05.0s/2m0s

running (0m06.0s), 50/50 VUs, 3943 complete and 0 interrupted iterations
nightly_export   [   5% ] 50 VUs  0m06.0s/2m0s

running (0m07.0s), 50/50 VUs, 3943 complete and 0 interrupted iterations
nightly_export   [   6% ] 50 VUs  0m07.0s/2m0s

running (0m08.0s), 50/50 VUs, 3943 complete and 0 interrupted iterations
nightly_export   [   7% ] 50 VUs  0m08.0s/2m0s

running (0m09.0s), 50/50 VUs, 5015 complete and 0 interrupted iterations
nightly_export   [   7% ] 50 VUs  0m09.0s/2m0s

running (0m10.0s), 50/50 VUs, 7005 complete and 0 interrupted iterations
nightly_export   [   8% ] 50 VUs  0m10.0s/2m0s

running (0m11.0s), 50/50 VUs, 7005 complete and 0 interrupted iterations
nightly_export   [   9% ] 50 VUs  0m11.0s/2m0s

running (0m12.0s), 50/50 VUs, 7005 complete and 0 interrupted iterations
nightly_export   [  10% ] 50 VUs  0m12.0s/2m0s

running (0m13.0s), 50/50 VUs, 7005 complete and 0 interrupted iterations
nightly_export   [  11% ] 50 VUs  0m13.0s/2m0s

running (0m14.0s), 50/50 VUs, 7005 complete and 0 interrupted iterations
nightly_export   [  12% ] 50 VUs  0m14.0s/2m0s

running (0m15.0s), 50/50 VUs, 7005 complete and 0 interrupted iterations
nightly_export   [  12% ] 50 VUs  0m15.0s/2m0s

running (0m16.0s), 50/50 VUs, 10347 complete and 0 interrupted iterations
nightly_export   [  13% ] 50 VUs  0m16.0s/2m0s

running (0m17.0s), 50/50 VUs, 10347 complete and 0 interrupted iterations
nightly_export   [  14% ] 50 VUs  0m17.0s/2m0s

running (0m18.0s), 50/50 VUs, 10347 complete and 0 interrupted iterations
nightly_export   [  15% ] 50 VUs  0m18.0s/2m0s

running (0m19.0s), 50/50 VUs, 10347 complete and 0 interrupted iterations
nightly_export   [  16% ] 50 VUs  0m19.0s/2m0s

running (0m20.0s), 50/50 VUs, 10347 complete and 0 interrupted iterations
nightly_export   [  17% ] 50 VUs  0m20.0s/2m0s

running (0m21.0s), 50/50 VUs, 14746 complete and 0 interrupted iterations
nightly_export   [  17% ] 50 VUs  0m21.0s/2m0s

running (0m22.0s), 50/50 VUs, 14746 complete and 0 interrupted iterations
nightly_export   [  18% ] 50 VUs  0m22.0s/2m0s

running (0m23.0s), 50/50 VUs, 14746 complete and 0 interrupted iterations
nightly_export   [  19% ] 50 VUs  0m23.0s/2m0s

running (0m24.0s), 50/50 VUs, 14746 complete and 0 interrupted iterations
nightly_export   [  20% ] 50 VUs  0m24.0s/2m0s

running (0m25.0s), 50/50 VUs, 14746 complete and 0 interrupted iterations
nightly_export   [  21% ] 50 VUs  0m25.0s/2m0s

running (0m26.0s), 50/50 VUs, 19395 complete and 0 interrupted iterations
nightly_export   [  22% ] 50 VUs  0m26.0s/2m0s

running (0m27.0s), 50/50 VUs, 19395 complete and 0 interrupted iterations
nightly_export   [  22% ] 50 VUs  0m27.0s/2m0s

running (0m28.0s), 50/50 VUs, 19395 complete and 0 interrupted iterations
nightly_export   [  23% ] 50 VUs  0m28.0s/2m0s

running (0m29.0s), 50/50 VUs, 19395 complete and 0 interrupted iterations
nightly_export   [  24% ] 50 VUs  0m29.0s/2m0s

running (0m30.0s), 50/50 VUs, 19395 complete and 0 interrupted iterations
nightly_export   [  25% ] 50 VUs  0m30.0s/2m0s

running (0m31.0s), 50/50 VUs, 19395 complete and 0 interrupted iterations
nightly_export   [  26% ] 50 VUs  0m31.0s/2m0s

running (0m32.0s), 50/50 VUs, 24086 complete and 0 interrupted iterations
nightly_export   [  27% ] 50 VUs  0m32.0s/2m0s

running (0m33.0s), 50/50 VUs, 24086 complete and 0 interrupted iterations
nightly_export   [  27% ] 50 VUs  0m33.0s/2m0s

running (0m34.0s), 50/50 VUs, 24086 complete and 0 interrupted iterations
nightly_export   [  28% ] 50 VUs  0m34.0s/2m0s

running (0m35.0s), 50/50 VUs, 24086 complete and 0 interrupted iterations
nightly_export   [  29% ] 50 VUs  0m35.0s/2m0s

running (0m36.0s), 50/50 VUs, 24086 complete and 0 interrupted iterations
nightly_export   [  30% ] 50 VUs  0m36.0s/2m0s

running (0m37.0s), 50/50 VUs, 24086 complete and 0 interrupted iterations
nightly_export   [  31% ] 50 VUs  0m37.0s/2m0s

running (0m38.0s), 50/50 VUs, 24086 complete and 0 interrupted iterations
nightly_export   [  32% ] 50 VUs  0m38.0s/2m0s

running (0m39.0s), 50/50 VUs, 24086 complete and 0 interrupted iterations
nightly_export   [  32% ] 50 VUs  0m39.0s/2m0s

running (0m40.0s), 50/50 VUs, 24086 complete and 0 interrupted iterations
nightly_export   [  33% ] 50 VUs  0m40.0s/2m0s

running (0m41.0s), 50/50 VUs, 24086 complete and 0 interrupted iterations
nightly_export   [  34% ] 50 VUs  0m41.0s/2m0s

running (0m42.0s), 50/50 VUs, 24086 complete and 0 interrupted iterations
nightly_export   [  35% ] 50 VUs  0m42.0s/2m0s

running (0m43.0s), 50/50 VUs, 28613 complete and 0 interrupted iterations
nightly_export   [  36% ] 50 VUs  0m43.0s/2m0s

running (0m44.0s), 50/50 VUs, 28613 complete and 0 interrupted iterations
nightly_export   [  37% ] 50 VUs  0m44.0s/2m0s

running (0m45.0s), 50/50 VUs, 28613 complete and 0 interrupted iterations
nightly_export   [  37% ] 50 VUs  0m45.0s/2m0s

running (0m46.0s), 50/50 VUs, 28613 complete and 0 interrupted iterations
nightly_export   [  38% ] 50 VUs  0m46.0s/2m0s

running (0m47.0s), 50/50 VUs, 28613 complete and 0 interrupted iterations
nightly_export   [  39% ] 50 VUs  0m47.0s/2m0s

running (0m48.0s), 50/50 VUs, 28613 complete and 0 interrupted iterations
nightly_export   [  40% ] 50 VUs  0m48.0s/2m0s

running (0m49.0s), 50/50 VUs, 28613 complete and 0 interrupted iterations
nightly_export   [  41% ] 50 VUs  0m49.0s/2m0s

running (0m50.0s), 50/50 VUs, 28613 complete and 0 interrupted iterations
nightly_export   [  42% ] 50 VUs  0m50.0s/2m0s

running (0m51.0s), 50/50 VUs, 28613 complete and 0 interrupted iterations
nightly_export   [  42% ] 50 VUs  0m51.0s/2m0s

running (0m52.0s), 50/50 VUs, 28613 complete and 0 interrupted iterations
nightly_export   [  43% ] 50 VUs  0m52.0s/2m0s

running (0m53.0s), 50/50 VUs, 28613 complete and 0 interrupted iterations
nightly_export   [  44% ] 50 VUs  0m53.0s/2m0s

running (0m54.0s), 50/50 VUs, 33497 complete and 0 interrupted iterations
nightly_export   [  45% ] 50 VUs  0m54.0s/2m0s

running (0m55.0s), 50/50 VUs, 33497 complete and 0 interrupted iterations
nightly_export   [  46% ] 50 VUs  0m55.0s/2m0s

running (0m56.0s), 50/50 VUs, 33497 complete and 0 interrupted iterations
nightly_export   [  47% ] 50 VUs  0m56.0s/2m0s

running (0m57.0s), 50/50 VUs, 33497 complete and 0 interrupted iterations
nightly_export   [  47% ] 50 VUs  0m57.0s/2m0s

running (0m58.0s), 50/50 VUs, 33497 complete and 0 interrupted iterations
nightly_export   [  48% ] 50 VUs  0m58.0s/2m0s

running (0m59.0s), 50/50 VUs, 33497 complete and 0 interrupted iterations
nightly_export   [  49% ] 50 VUs  0m59.0s/2m0s

running (1m00.0s), 50/50 VUs, 33497 complete and 0 interrupted iterations
nightly_export   [  50% ] 50 VUs  1m00.0s/2m0s

running (1m01.0s), 50/50 VUs, 33497 complete and 0 interrupted iterations
nightly_export   [  51% ] 50 VUs  1m01.0s/2m0s

running (1m02.0s), 50/50 VUs, 33497 complete and 0 interrupted iterations
nightly_export   [  52% ] 50 VUs  1m02.0s/2m0s

running (1m03.0s), 50/50 VUs, 33497 complete and 0 interrupted iterations
nightly_export   [  52% ] 50 VUs  1m03.0s/2m0s

running (1m04.0s), 50/50 VUs, 37134 complete and 0 interrupted iterations
nightly_export   [  53% ] 50 VUs  1m04.0s/2m0s

running (1m05.0s), 50/50 VUs, 91343 complete and 0 interrupted iterations
nightly_export   [  54% ] 50 VUs  1m05.0s/2m0s

running (1m06.0s), 50/50 VUs, 148179 complete and 0 interrupted iterations
nightly_export   [  55% ] 50 VUs  1m06.0s/2m0s

running (1m07.0s), 50/50 VUs, 183668 complete and 0 interrupted iterations
nightly_export   [  56% ] 50 VUs  1m07.0s/2m0s

running (1m08.0s), 50/50 VUs, 183668 complete and 0 interrupted iterations
nightly_export   [  57% ] 50 VUs  1m08.0s/2m0s

running (1m09.0s), 50/50 VUs, 183712 complete and 0 interrupted iterations
nightly_export   [  57% ] 50 VUs  1m09.0s/2m0s

running (1m10.0s), 50/50 VUs, 183712 complete and 0 interrupted iterations
nightly_export   [  58% ] 50 VUs  1m10.0s/2m0s

running (1m11.0s), 50/50 VUs, 183712 complete and 0 interrupted iterations
nightly_export   [  59% ] 50 VUs  1m11.0s/2m0s

running (1m12.0s), 50/50 VUs, 183712 complete and 0 interrupted iterations
nightly_export   [  60% ] 50 VUs  1m12.0s/2m0s

running (1m13.0s), 50/50 VUs, 183712 complete and 0 interrupted iterations
nightly_export   [  61% ] 50 VUs  1m13.0s/2m0s

running (1m14.0s), 50/50 VUs, 187650 complete and 0 interrupted iterations
nightly_export   [  62% ] 50 VUs  1m14.0s/2m0s

running (1m15.0s), 50/50 VUs, 187650 complete and 0 interrupted iterations
nightly_export   [  62% ] 50 VUs  1m15.0s/2m0s

running (1m16.0s), 50/50 VUs, 187650 complete and 0 interrupted iterations
nightly_export   [  63% ] 50 VUs  1m16.0s/2m0s

running (1m17.0s), 50/50 VUs, 187650 complete and 0 interrupted iterations
nightly_export   [  64% ] 50 VUs  1m17.0s/2m0s

running (1m18.0s), 50/50 VUs, 187650 complete and 0 interrupted iterations
nightly_export   [  65% ] 50 VUs  1m18.0s/2m0s

running (1m19.0s), 50/50 VUs, 187650 complete and 0 interrupted iterations
nightly_export   [  66% ] 50 VUs  1m19.0s/2m0s

running (1m20.0s), 50/50 VUs, 187650 complete and 0 interrupted iterations
nightly_export   [  67% ] 50 VUs  1m20.0s/2m0s

running (1m21.0s), 50/50 VUs, 187650 complete and 0 interrupted iterations
nightly_export   [  67% ] 50 VUs  1m21.0s/2m0s

running (1m22.0s), 50/50 VUs, 187650 complete and 0 interrupted iterations
nightly_export   [  68% ] 50 VUs  1m22.0s/2m0s

running (1m23.0s), 50/50 VUs, 187650 complete and 0 interrupted iterations
nightly_export   [  69% ] 50 VUs  1m23.0s/2m0s

running (1m24.0s), 50/50 VUs, 187650 complete and 0 interrupted iterations
nightly_export   [  70% ] 50 VUs  1m24.0s/2m0s

running (1m25.0s), 50/50 VUs, 187650 complete and 0 interrupted iterations
nightly_export   [  71% ] 50 VUs  1m25.0s/2m0s

running (1m26.0s), 50/50 VUs, 187650 complete and 0 interrupted iterations
nightly_export   [  72% ] 50 VUs  1m26.0s/2m0s

running (1m27.0s), 50/50 VUs, 187650 complete and 0 interrupted iterations
nightly_export   [  72% ] 50 VUs  1m27.0s/2m0s

running (1m28.0s), 50/50 VUs, 187650 complete and 0 interrupted iterations
nightly_export   [  73% ] 50 VUs  1m28.0s/2m0s

running (1m29.0s), 50/50 VUs, 215907 complete and 0 interrupted iterations
nightly_export   [  74% ] 50 VUs  1m29.0s/2m0s

running (1m30.0s), 50/50 VUs, 275542 complete and 0 interrupted iterations
nightly_export   [  75% ] 50 VUs  1m30.0s/2m0s

running (1m31.0s), 50/50 VUs, 336759 complete and 0 interrupted iterations
nightly_export   [  76% ] 50 VUs  1m31.0s/2m0s

running (1m32.0s), 50/50 VUs, 397328 complete and 0 interrupted iterations
nightly_export   [  77% ] 50 VUs  1m32.0s/2m0s

running (1m33.0s), 50/50 VUs, 455926 complete and 0 interrupted iterations
nightly_export   [  77% ] 50 VUs  1m33.0s/2m0s

running (1m34.0s), 50/50 VUs, 517069 complete and 0 interrupted iterations
nightly_export   [  78% ] 50 VUs  1m34.0s/2m0s

running (1m35.0s), 50/50 VUs, 570594 complete and 0 interrupted iterations
nightly_export   [  79% ] 50 VUs  1m35.0s/2m0s

running (1m36.0s), 50/50 VUs, 629869 complete and 0 interrupted iterations
nightly_export   [  80% ] 50 VUs  1m36.0s/2m0s

running (1m37.0s), 50/50 VUs, 687376 complete and 0 interrupted iterations
nightly_export   [  81% ] 50 VUs  1m37.0s/2m0s

running (1m38.0s), 50/50 VUs, 745888 complete and 0 interrupted iterations
nightly_export   [  82% ] 50 VUs  1m38.0s/2m0s

running (1m39.0s), 50/50 VUs, 804972 complete and 0 interrupted iterations
nightly_export   [  82% ] 50 VUs  1m39.0s/2m0s

running (1m40.0s), 50/50 VUs, 810938 complete and 0 interrupted iterations
nightly_export   [  83% ] 50 VUs  1m40.0s/2m0s

running (1m41.0s), 50/50 VUs, 810938 complete and 0 interrupted iterations
nightly_export   [  84% ] 50 VUs  1m41.0s/2m0s

running (1m42.0s), 50/50 VUs, 810938 complete and 0 interrupted iterations
nightly_export   [  85% ] 50 VUs  1m42.0s/2m0s

running (1m43.0s), 50/50 VUs, 813570 complete and 0 interrupted iterations
nightly_export   [  86% ] 50 VUs  1m43.0s/2m0s

running (1m44.0s), 50/50 VUs, 813570 complete and 0 interrupted iterations
nightly_export   [  87% ] 50 VUs  1m44.0s/2m0s

running (1m45.0s), 50/50 VUs, 813570 complete and 0 interrupted iterations
nightly_export   [  87% ] 50 VUs  1m45.0s/2m0s

running (1m46.0s), 50/50 VUs, 813570 complete and 0 interrupted iterations
nightly_export   [  88% ] 50 VUs  1m46.0s/2m0s

running (1m47.0s), 50/50 VUs, 813570 complete and 0 interrupted iterations
nightly_export   [  89% ] 50 VUs  1m47.0s/2m0s

running (1m48.0s), 50/50 VUs, 813570 complete and 0 interrupted iterations
nightly_export   [  90% ] 50 VUs  1m48.0s/2m0s

running (1m49.0s), 50/50 VUs, 813570 complete and 0 interrupted iterations
nightly_export   [  91% ] 50 VUs  1m49.0s/2m0s

running (1m50.0s), 50/50 VUs, 813570 complete and 0 interrupted iterations
nightly_export   [  92% ] 50 VUs  1m50.0s/2m0s

running (1m51.0s), 50/50 VUs, 813570 complete and 0 interrupted iterations
nightly_export   [  92% ] 50 VUs  1m51.0s/2m0s

running (1m52.0s), 50/50 VUs, 813570 complete and 0 interrupted iterations
nightly_export   [  93% ] 50 VUs  1m52.0s/2m0s

running (1m53.0s), 50/50 VUs, 813570 complete and 0 interrupted iterations
nightly_export   [  94% ] 50 VUs  1m53.0s/2m0s

running (1m54.0s), 50/50 VUs, 867869 complete and 0 interrupted iterations
nightly_export   [  95% ] 50 VUs  1m54.0s/2m0s

running (1m55.0s), 50/50 VUs, 922824 complete and 0 interrupted iterations
nightly_export   [  96% ] 50 VUs  1m55.0s/2m0s

running (1m56.0s), 50/50 VUs, 977988 complete and 0 interrupted iterations
nightly_export   [  97% ] 50 VUs  1m56.0s/2m0s

running (1m57.0s), 50/50 VUs, 1031163 complete and 0 interrupted iterations
nightly_export   [  97% ] 50 VUs  1m57.0s/2m0s

running (1m58.0s), 50/50 VUs, 1086878 complete and 0 interrupted iterations
nightly_export   [  98% ] 50 VUs  1m58.0s/2m0s

running (1m59.0s), 50/50 VUs, 1145737 complete and 0 interrupted iterations
nightly_export   [  99% ] 50 VUs  1m59.0s/2m0s

running (2m00.0s), 50/50 VUs, 1199937 complete and 0 interrupted iterations
nightly_export   [ 100% ] 50 VUs  2m00.0s/2m0s


  █ THRESHOLDS 

    http_req_failed
    ✗ 'rate<0.05' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 1200251 10002.108253/s
    checks_succeeded...: 0.00%   0 out of 1200251
    checks_failed......: 100.00% 1200251 out of 1200251

    ✗ status is 200
      ↳  0% — ✓ 0 / ✗ 1200251

    HTTP
    http_req_duration....: avg=4.43ms min=0s      med=0s       max=15.01s p(90)=0s     p(95)=0s    
    http_req_failed......: 100.00% 1200251 out of 1200251
    http_reqs............: 1200251 10002.108253/s

    EXECUTION
    iteration_duration...: avg=4.99ms min=30.62µs med=106.25µs max=15.02s p(90)=2.16ms p(95)=3.29ms
    iterations...........: 1200251 10002.108253/s
    vus..................: 50      min=50                 max=50
    vus_max..............: 50      min=50                 max=50

    NETWORK
    data_received........: 0 B     0 B/s
    data_sent............: 3.9 MB  33 kB/s



running (2m00.0s), 00/50 VUs, 1200251 complete and 0 interrupted iterations
nightly_export ✓ [ 100% ] 50 VUs  2m0s
time="2026-08-18T09:52:48+03:00" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"